\documentclass[letterpaper,10pt,draftclsnofoot,onecolumn]{IEEEtran}

\usepackage{graphicx}                                        
\usepackage{amssymb}                                         
\usepackage{amsmath}                                         
\usepackage{amsthm}                                          

\usepackage{alltt}                                           
\usepackage{float}
\usepackage{color}
\usepackage{url}
\usepackage{upquote}
\usepackage{array}
\usepackage{balance}
\usepackage[TABBOTCAP, tight]{subfigure}
\usepackage{enumitem}
\usepackage{pstricks, pst-node}
\usepackage[utf8]{inputenc}

\usepackage{listings}

\usepackage{geometry}
\geometry{textheight=8.5in, textwidth=6in}

%random comment

\newcommand{\cred}[1]{{\color{red}#1}}
\newcommand{\cblue}[1]{{\color{blue}#1}}

\usepackage{hyperref}
\usepackage{geometry}

\def\name{Sinan Topkaya}

%pull in the necessary preamble matter for pygments output
%\input{pygments.tex}

%% The following metadata will show up in the PDF properties
\hypersetup{
  colorlinks = true,
  urlcolor = black,
  pdfauthor = {\name},
  pdfkeywords = {cs444  Final},
  pdftitle = {CS 444 Final: Final},
  pdfsubject = {CS 444},
  pdfpagemode = UseNone
}

\parindent = 0.0 in
\parskip = 0.2 in

\begin{document}


	\begin{titlepage}
		
		\begin{center}
		\bigbreak	
		\textbf{Operating System Feature Comparison}
		\bigbreak
		by Sinan Topkaya
		\smallbreak
		CS 444 - Spring 2016
		\end{center}
		\vfill
		
		Abstract: This paper will examine processes, threads and CPU scheduling, I/O, interrupts and memory management for Windows and FreeBSD operating systems. It will mainly be about how these operating systems implement them and how is it different or similar compared to Linux. 
		
	\end{titlepage}

\section*{Processes, Threads and CPU Scheduling}
A process is a program that is running on your computer. This can be anything from a small background task, such as a spell-checker or system events handler to a full-blown application like Internet Explorer or Microsoft Word. All processes are composed of one or more threads. In computer science, a thread of execution is the smallest sequence of programmed instructions that can be managed independently by a scheduler, which is typically a part of the operating system. The process scheduling is the activity of the process manager that handles the removal of the running process from the CPU and the selection of another process on the basis of a particular strategy. Process scheduling is an essential part of a Multiprogramming operating system.
Each Windows process is represented by an executive process(EPROCESS) structure. EPROCESS contains and points to a number of other related data structures. Likewise, if each process has one or more threads, each of them are represented by and executive thread(ETHREAD) structure. To understand how Windows implements Processes and Threads we have to understand the structure EPROCESS and ETHREAD. 
The EPROCESS and most of its data structures exist in system address space, except for process environment block(PEB), which exist in the process address space. The reason for that is because PEB contains information accessed by user-mode code. For each process that is executing Win32 program, the Win32 subsystem process (Csrss) maintains a parallel structure called the \verb|CSR_PROCES|, kernel-mode part of the Win32 subsystem(Win32k.sys) maintains a per-process data structure, \verb|W32PROCESS|. The W32PROCESS structure is created the first time a thread calls Windows USER or GDI function implemented in kernel code. Every EPROCESS structure is en capsulated as a process object by the executive object manager, but because processes are not named objects, they are not visible in WinObj tool. Many other drivers and system components, can choose to create their own data structures to track information on a per-process basis. It is also important to take data structure sizes into consideration.\cite{[1]}

\begin{figure}[H]
\begin{lstlisting}
lkd> dt \verb|_kprocess|
\verb|nt!_KPROCESS|
+0x000 Header				: _DISPATCHER_HEADER
+0x010 ProfileListHead 		: _LIST_ENTRY
+0x018 DirectoryTableBase	: Uint4B
...
+0x074 StackCount			: _KSTACK_COUNT
+0x078 ProcessListEntry 	: _LIST_ENTRY
+0x080 CycleTime			:  Uint8B
+0x088 KernelTime			: Uint4B
+0x08c UserTime				: Uint4B
+0x090 VdmTrapcHandler		: Ptr32 Void
\end{lstlisting}
\end{figure}
Process Object: \verb|EPROCESS| structure has many key fields. APIs and components are divided into layered modules with their own naming. For example one of the key field(member) of a executive process structure is called Pcb, or in other words process control block. This is a structure of type \verb|KPROCESS|, for kernel process. Although routines store information in EPROCESS, the dispatcher, scheduler and inturrept/time use KPROCESS. Therefore, allowing a layer to exist between high-level functionality and its underlying low-level implementation of functions, this also helps prevent unwanted dependencies between layers. Data structure \verb|PEB| lives in the user-mode adress space of the process, it contains information needed by image loader, the heap manager, and other Windows components that need to access it from user mode. The \verb|CSR_PROCESS| structure contains information about processes that is specific to the Windows subsystem. \verb|W32PROCESS| structure contains information that the Windows graphics and window management code in kernel needs to maintain state information about GUI processes. Each of these data structures have different process structure and hold important information about the Process.
\begin{figure}[H]
\begin{lstlisting}
lkd> dt nt!_eprocess
+0x000 Pcb				: _KPROCESS
+0x080 ProcessLock		: _EX_PUSH_LOCK
+0x088 CreateTime		: _LARGE_INTEGER
+0x090 ExitTime			: _LARGE_INTEGER
+0x098 RundownProtect	: _EX_RUNDOWN_REF
+0x09c UniqueProcessId 	: Ptr32 Void
...
+0x0dc ObjectTable		: Ptr32 _HANDLE_TABLE
+0x0e0 Token			: _EX_FAST_REF
...
+0x108 Win32Process		: Ptr32 Void
+0x10c Job				: Ptr32 _EJOB
...
+0x2a8 TimerResolutionLink : _LIST_ENTRY
+0x2b0 RequestedTimerResolution : Uint4B	
+0x2b4 ActiveThreadsHighWatermark : Uint4B
+0x2b8 SmallestTimerResolution : Uint4B
+0x2bc TimerResolutionStackRecord : Ptr32 _PO_DIAG_STACK_RECORD
\end{lstlisting}
\end{figure}
CreateProcess: Creating a process involves many steps
\begin{enumerate}
\item Validate parameters; convert Windows subsystem flags and options to their native counterparts; parse, validate, and convert the attribute list to its native counterpart.
\item Open the image file(.exe) to be executed inside the process.
\item Create the Windows executive process object
\item Create the initial thread
\item Perform post-creation, Windows-subsystem-specific process initialization.
\item Start execution of the initial thread
\item In the context of the new process and thread, complete the initialization of the address space and begin execution of the program.
\end{enumerate}
\lstset{language=C++,
                basicstyle=\ttfamily,
                keywordstyle=\color{blue}\ttfamily,
                stringstyle=\color{red}\ttfamily,
                commentstyle=\color{green}\ttfamily,
